## Pandas

1. Pandas is an open-source library that is built on top of NumPy library. 
2. It is a Python package that offers various data structures and operations for manipulating numerical data and time series. 
3. It is mainly popular for importing and analyzing data much easier. 
4. Pandas is fast and it has high-performance & productivity for users.

### Pandas DataFrame

1. Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 
2. A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. 
3. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [1]:
import pandas as pd

In [2]:
print(pd.__version__),

0.20.3

In [3]:
lst = ['A', 'B', 'C', 'D']

# pandas DataFrame using list

df = pd.DataFrame(lst)

print(df)

   0
0  A
1  B
2  C
3  D

In [4]:
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame using Dictionary
df = pd.DataFrame(data)
 
# Print the output.
print(df)

   Age   Name
0   20    Tom
1   21   nick
2   19  krish
3   18   jack

In [6]:
df[['Age']] # Row selection of df

   Age
0   20
1   21
2   19
3   18

In [7]:
df['Name']

0      Tom
1     nick
2    krish
3     jack
Name: Name, dtype: object

In [8]:
row3 = df.iloc[3]

In [9]:
row3

Age       18
Name    jack
Name: 3, dtype: object

In [11]:
import numpy as np

nparr = np.array(['A', 'B', 'C'])

# Create pandas series using numpy array

series = pd.Series(nparr)

print(series)

0    A
1    B
2    C
dtype: object

In [12]:
series[:2]

0    A
1    B
dtype: object

In [13]:
series.head()

0    A
1    B
2    C
dtype: object

In [14]:
series.loc[:2]

0    A
1    B
2    C
dtype: object

In [15]:
# read csv file pd.read_csv()

df = pd.read_csv('nba.csv')

In [17]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [18]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [19]:
df.shape

(458, 9)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [21]:
df.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [23]:
df.index

RangeIndex(start=0, stop=458, step=1)

In [24]:
df = pd.read_csv('nba.csv',index_col='Name')

In [25]:
df.shape

(458, 8)

In [26]:
df.index

Index([ 'Avery Bradley',    'Jae Crowder',   'John Holland',    'R.J. Hunter',
        'Jonas Jerebko',   'Amir Johnson',  'Jordan Mickey',   'Kelly Olynyk',
         'Terry Rozier',   'Marcus Smart',
       ...
       'Gordon Hayward',    'Rodney Hood',     'Joe Ingles',  'Chris Johnson',
           'Trey Lyles',   'Shelvin Mack',      'Raul Neto',   'Tibor Pleiss',
          'Jeff Withey',              nan],
      dtype='object', name='Name', length=458)

In [27]:
df.loc[['Avery Bradley']]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [29]:
df.loc[['Joe Ingles']]

                 Team  Number Position   Age Height  Weight College     Salary
Name
Joe Ingles  Utah Jazz     2.0       SF  28.0    6-8   226.0     NaN  2050000.0

In [30]:
df.loc[['Avery Bradley', 'Joe Ingles']]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0

In [32]:
df.loc['Avery Bradley' : 'John Holland']

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [35]:
df.iloc[[1]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [36]:
df.iloc[[0]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [42]:
df.iloc[[0,4,6,7]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [43]:
df.columns

Index(['Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College',
       'Salary'],
      dtype='object')

In [46]:
df.loc[:'Jonas Jerebko',['Team','Age']]

                         Team   Age
Name
Avery Bradley  Boston Celtics  25.0
Jae Crowder    Boston Celtics  25.0
John Holland   Boston Celtics  27.0
R.J. Hunter    Boston Celtics  22.0
Jonas Jerebko  Boston Celtics  29.0

In [47]:
df.iloc[:5,[0,2, 5]]

                         Team Position  Weight
Name
Avery Bradley  Boston Celtics       PG   180.0
Jae Crowder    Boston Celtics       SF   235.0
John Holland   Boston Celtics       SG   205.0
R.J. Hunter    Boston Celtics       SG   185.0
Jonas Jerebko  Boston Celtics       PF   231.0

In [48]:
df.ix['Avery Bradley']

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object

In [53]:
df[df.Age > 35]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
Luis Scola,Toronto Raptors,4.0,PF,36.0,6-9,240.0,NaN,2900000.0
Jamal Crawford,Los Angeles Clippers,11.0,SG,36.0,6-5,195.0,Michigan,5675000.0
Paul Pierce,Los Angeles Clippers,34.0,SF,38.0,6-7,235.0,Kansas,3376000.0
Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0
Metta World Peace,Los Angeles Lakers,37.0,SF,36.0,6-7,260.0,St. John's,947276.0
Caron Butler,Sacramento Kings,31.0,SF,36.0,6-7,228.0,Connecticut,1449187.0
Steve Blake,Detroit Pistons,22.0,PG,36.0,6-3,172.0,Maryland,2170465.0
Dirk Nowitzki,Dallas Mavericks,41.0,PF,37.0,7-0,245.0,NaN,8333334.0
Jason Terry,Houston Rockets,31.0,SG,38.0,6-2,185.0,Arizona,947276.0
Chris Andersen,Memphis Grizzlies,7.0,PF,37.0,6-10,245.0,Blinn College,5000000.0
Matt Barnes,Memphis Grizzlies,22.0,SF,36.0,6-7,226.0,UCLA,3542500.0
Vince Carter,Memphis Grizzlies,15.0,SG,39.0,6-6,220.0,North Carolina,4088019.0
Matt Bonner,San Antonio Spurs,15.0,C,36.0,6-10,235.0,Florida,947276.0
Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
Manu Ginobili,San Antonio Spurs,20.0,SG,38.0,6-6,205.0,NaN,2814000.0
Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
Udonis Haslem,Miami Heat,40.0,PF,36.0,6-8,235.0,Florida,2854940.0
Mike Miller,Denver Nuggets,3.0,SG,36.0,6-8,218.0,Florida,947276.0
Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
Tayshaun Prince,Minnesota Timberwolves,12.0,SF,36.0,6-9,212.0,Kentucky,947276.0
Nazr Mohammed,Oklahoma City Thunder,13.0,C,38.0,6-10,250.0,Kentucky,222888.0

In [57]:
df.groupby('Age').size()

Age
19.0     2
20.0    19
21.0    19
22.0    26
23.0    41
24.0    47
25.0    45
26.0    36
27.0    41
28.0    31
29.0    28
30.0    31
31.0    22
32.0    13
33.0    14
34.0    10
35.0     9
36.0    10
37.0     4
38.0     4
39.0     2
40.0     3
dtype: int64

In [58]:
df['Age'].value_counts()

24.0    47
25.0    45
27.0    41
23.0    41
26.0    36
28.0    31
30.0    31
29.0    28
22.0    26
31.0    22
21.0    19
20.0    19
33.0    14
32.0    13
36.0    10
34.0    10
35.0     9
38.0     4
37.0     4
40.0     3
39.0     2
19.0     2
Name: Age, dtype: int64

In [60]:
df.groupby('Name', sort=False)['Age'].sum()

Name
Avery Bradley              25.0
Jae Crowder                25.0
John Holland               27.0
R.J. Hunter                22.0
Jonas Jerebko              29.0
Amir Johnson               29.0
Jordan Mickey              21.0
Kelly Olynyk               25.0
Terry Rozier               22.0
Marcus Smart               22.0
Jared Sullinger            24.0
Isaiah Thomas              27.0
Evan Turner                27.0
James Young                20.0
Tyler Zeller               26.0
Bojan Bogdanovic           27.0
Markel Brown               24.0
Wayne Ellington            28.0
Rondae Hollis-Jefferson    21.0
Jarrett Jack               32.0
Sergey Karasev             22.0
Sean Kilpatrick            26.0
Shane Larkin               23.0
Brook Lopez                28.0
Chris McCullough           21.0
Willie Reed                26.0
Thomas Robinson            25.0
Henry Sims                 26.0
Donald Sloan               28.0
Thaddeus Young             27.0
                           ...
Cliff Alexander            20.0
Al-Farouq Aminu            25.0
Pat Connaughton            23.0
Allen Crabbe               24.0
Ed Davis                   27.0
Maurice Harkless           23.0
Gerald Henderson           28.0
Chris Kaman                34.0
Meyers Leonard             24.0
Damian Lillard             25.0
C.J. McCollum              24.0
Luis Montero               23.0
Mason Plumlee              26.0
Brian Roberts              30.0
Noah Vonleh                20.0
Trevor Booker              28.0
Trey Burke                 23.0
Alec Burks                 24.0
Dante Exum                 20.0
Derrick Favors             24.0
Rudy Gobert                23.0
Gordon Hayward             26.0
Rodney Hood                23.0
Joe Ingles                 28.0
Chris Johnson              26.0
Trey Lyles                 20.0
Shelvin Mack               26.0
Raul Neto                  24.0
Tibor Pleiss               26.0
Jeff Withey                26.0
Name: Age, Length: 457, dtype: float64

In [73]:
grp = df.head(5).groupby('Name')

In [74]:
type(grp.groups)

dict

In [75]:
len(grp.groups)

5

In [77]:
for name, group in grp:
    print(name)
    print(group)
    print()

Avery Bradley
                         Team  Number Position   Age Height  Weight College  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0   Texas

                  Salary
Name
Avery Bradley  7730337.0

Jae Crowder
                       Team  Number Position   Age Height  Weight    College  \
Name
Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0  Marquette

                Salary
Name
Jae Crowder  6796117.0

John Holland
                        Team  Number Position   Age Height  Weight  \
Name
John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0

                        College  Salary
Name
John Holland  Boston University     NaN

Jonas Jerebko
                         Team  Number Position   Age Height  Weight College  \
Name
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0     NaN

                  Salary
Name
Jonas Jerebko  5000000.0

R.J. Hunter
                       Team  Number Position   Age Height  Weight  \
Name
R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0

                   College     Salary
Name
R.J. Hunter  Georgia State  1148640.0

In [79]:
grp.get_group('Avery Bradley')

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

In [80]:
grp.aggregate(np.sum)

               Number   Age  Weight     Salary
Name
Avery Bradley     0.0  25.0   180.0  7730337.0
Jae Crowder      99.0  25.0   235.0  6796117.0
John Holland     30.0  27.0   205.0        NaN
Jonas Jerebko     8.0  29.0   231.0  5000000.0
R.J. Hunter      28.0  22.0   185.0  1148640.0

In [81]:
grp['Age'].agg([np.sum, np.mean, np.std])

                sum  mean  std
Name
Avery Bradley  25.0  25.0  NaN
Jae Crowder    25.0  25.0  NaN
John Holland   27.0  27.0  NaN
Jonas Jerebko  29.0  29.0  NaN
R.J. Hunter    22.0  22.0  NaN

In [86]:
grp.agg({'Age': 'sum', 'Salary': 'std'})

                Age  Salary
Name
Avery Bradley  25.0     NaN
Jae Crowder    25.0     NaN
John Holland   27.0     NaN
Jonas Jerebko  29.0     NaN
R.J. Hunter    22.0     NaN

In [89]:
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
 
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
 
print(df, "\n\n", df1)

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd

      Address  Age    Name Qualification
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

In [90]:
res1 = pd.concat([df,df1])

In [91]:
df.shape, df1.shape, res1.shape

((4, 4), (4, 4), (8, 4))

In [94]:
res2 = pd.concat([df, df1], axis=1)

In [95]:
res2

,Address,Age,Name,Qualification,Address,Age,Name,Qualification
0,Nagpur,27.0,Jai,Msc,NaN,NaN,NaN,NaN
1,Kanpur,24.0,Princi,MA,NaN,NaN,NaN,NaN
2,Allahabad,22.0,Gaurav,MCA,NaN,NaN,NaN,NaN
3,Kannuaj,32.0,Anuj,Phd,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,Nagpur,17.0,Abhi,Btech
5,NaN,NaN,NaN,NaN,Kanpur,14.0,Ayushi,B.A
6,NaN,NaN,NaN,NaN,Allahabad,12.0,Dhiraj,Bcom
7,NaN,NaN,NaN,NaN,Kannuaj,52.0,Hitesh,B.hons

In [96]:
df.shape, df1.shape, res1.shape, res2.shape

((4, 4), (4, 4), (8, 4), (8, 8))

In [97]:
res1

     Address  Age    Name Qualification
0     Nagpur   27     Jai           Msc
1     Kanpur   24  Princi            MA
2  Allahabad   22  Gaurav           MCA
3    Kannuaj   32    Anuj           Phd
4     Nagpur   17    Abhi         Btech
5     Kanpur   14  Ayushi           B.A
6  Allahabad   12  Dhiraj          Bcom
7    Kannuaj   52  Hitesh        B.hons

In [98]:
res = pd.concat([df, df1], keys=['df','df1'])

In [99]:
res

         Address  Age    Name Qualification
df  0     Nagpur   27     Jai           Msc
    1     Kanpur   24  Princi            MA
    2  Allahabad   22  Gaurav           MCA
    3    Kannuaj   32    Anuj           Phd
df1 4     Nagpur   17    Abhi         Btech
    5     Kanpur   14  Ayushi           B.A
    6  Allahabad   12  Dhiraj          Bcom
    7    Kannuaj   52  Hitesh        B.hons

In [101]:
res = pd.merge(df, df1, on='Address', how='inner')

In [102]:
res

     Address  Age_x  Name_x Qualification_x  Age_y  Name_y Qualification_y
0     Nagpur     27     Jai             Msc     17    Abhi           Btech
1     Kanpur     24  Princi              MA     14  Ayushi             B.A
2  Allahabad     22  Gaurav             MCA     12  Dhiraj            Bcom
3    Kannuaj     32    Anuj             Phd     52  Hitesh          B.hons

In [104]:
res = df[['Address','Age']].join(df1[['Name']])

In [105]:
res

     Address  Age Name
0     Nagpur   27  NaN
1     Kanpur   24  NaN
2  Allahabad   22  NaN
3    Kannuaj   32  NaN

In [106]:
data = pd.date_range('1/1/2021',periods=10, freq='H')

In [107]:
data

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [108]:
dataD = pd.date_range('1/1/2021', periods=31, freq='D')

In [109]:
dataD

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31'],
              dtype='datetime64[ns]', freq='D')

In [112]:
import datetime

In [114]:
x = datetime.datetime.now()

In [115]:
x.year, x.month, x.date, x.hour

(2021, 12, <function datetime.date>, 18)

In [118]:
rng = pd.DataFrame()

In [119]:
rng['date'] = pd.date_range('1/1/2021', periods=72, freq='H')

In [121]:
rng.shape

(72, 1)

In [124]:
rng['year'] = rng['date'].dt.year
rng['month'] = rng['date'].dt.month
rng['day'] = rng['date'].dt.day
rng['hour'] = rng['date'].dt.hour
rng['minute'] = rng['date'].dt.minute

In [125]:
rng.head()

                 date  year  month  day  hour  minute
0 2021-01-01 00:00:00  2021      1    1     0       0
1 2021-01-01 01:00:00  2021      1    1     1       0
2 2021-01-01 02:00:00  2021      1    1     2       0
3 2021-01-01 03:00:00  2021      1    1     3       0
4 2021-01-01 04:00:00  2021      1    1     4       0

In [127]:
t = pd.tslib.Timestamp.now()

In [128]:
t

Timestamp('2021-12-26 18:26:56.469729')

In [130]:
t.to_datetime()

C:\Users\Rohit\AppData\Local\conda\conda\envs\my_root\lib\site-packages\IPython\core\interactiveshell.py:2862: FutureWarning: to_datetime is deprecated. Use self.to_pydatetime()
  exec(code_obj, self.user_global_ns, self.user_ns)

datetime.datetime(2021, 12, 26, 18, 26, 56, 469729)

In [133]:
print(t.year)
print(t.month)
print(t.day)
print(t.hour)
print(t.minute)
print(t.second)

2021
12
26
18
26
56

In [134]:
df.Name.str.lower()

0       jai
1    princi
2    gaurav
3      anuj
Name: Name, dtype: object

In [135]:
df.columns

Index(['Address', 'Age', 'Name', 'Qualification'], dtype='object')

In [136]:
df.Address.str.upper()

0       NAGPUR
1       KANPUR
2    ALLAHABAD
3      KANNUAJ
Name: Address, dtype: object

In [139]:
df.Age.replace(27, 'Twenty Seven')

0    Twenty Seven
1              24
2              22
3              32
Name: Age, dtype: object